# Задача
> Написать программу, которая из имеющегося массива строк формирует массив из строк, длина которых меньше либо равна 3 символа. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. 
---
## Содержание
1. [Заполнение массива с клавиатуры](#заполнение-массива-с-клавиатуры)
2. [Вывод массива в терминал](#вывод-массива-в-терминал)
3. [Метод решения задачи](#метод-решения-задачи)
4. [Проверка на корректность ввода данных пользователем](#проверка-на-корректность-ввода-пользователем)
---
## __*Решение*__
---
1. ### *Заполнение массива с клавиатуры*
> Пользоватеь задает размер массива.
```
Console.Write("Задайте размер массива: ");
int size = Convert.ToInt32(Console.ReadLine());
```
>> Создаем метод заполнения индексов массива пользователем.
```
string[] ArrayString(int size)
{
    string[] array = new string[size];
    for (int i = 0; i < array.Length; i++)
    {
        Console.Write($"Введите {i} индекс массива: ");
        array[i] = Console.ReadLine();
    }
    return array;
}
```
---
2. ### *Вывод массива в терминал*
> Для читабельности массива в терминале, создаем метод с расстановкой знаков. Знаки можно ставить любые, в данном случе используются квадратные скобки "[ ]" и запятые ",".
```
void PrintArrayString(string[] array)
{
    Console.Write("[");
    for (int i = 0; i < array.Length; i++)
    {
        if (i < array.Length - 1) Console.Write($"‟{array[i]}‟,");
        else Console.Write($"‟{array[i]}‟");
    }
    Console.Write("]");
}
```
3. ### *Метод решения задачи*
>Делаем проверку каждого индекса массива на длину **меньше или равно** *3-м* символам для нахождения длинны нового массива. Формируем новый массив. Заполняем индексы нового массива. 
```
string[] NewArrayString(string[] array)
{
    int count = 0;
    for (int i = 0; i < array.Length; i++)
    {
        if (array[i].Length <= 3) count++;
    }
    string[] newArray = new string[count];
    int j = 0;
    for (int i = 0; i < array.Length; i++)
    {
        if (array[i].Length <= 3)
        {
            newArray[j] = array[i];
            j++;
        }
    }
    return newArray;
}
```
4. ### *Проверка на корректность ввода данных пользователем*
> В случае не корректного ввода данных, пользователю будет выдана "Ошибка ввода данных".
```
if (size <= 0) Console.WriteLine("Ошибка ввода данных");
```
>> При верном вводе данных запускаем наши методы в работу.
```
else
{
    string[] array = ArrayString(size);
    PrintArrayString(array);
    string[] newArray = NewArrayString(array);
    Console.WriteLine();
    PrintArrayString(newArray);
}
```